[
  {"name": "INFP",
  "summary": "<h4>\"MEDIATOR\"</h4> For INFPs the dominant quality in their lives is a deep-felt caring and idealism about people. They experience this intense caring most often in their relationships with others, but they may also experience it around ideas, projects, or any involvement they see as important. INFPs are often skilled communicators, and they are naturally drawn to ideas that embody a concern for human potential. INFPs live in the inner world of values and ideals, but what people often first encounter with the INFP in the outer world is their adaptability and concern for possibilities.<a href=\"https://en.wikipedia.org/wiki/INFP\" target=\"_blank\"><p>More inforamtion</p></a>" },

{"name": "INTP",
  "summary": "<h4>\"LOGICIAN\"</h4> For INTPs the driving force in their lives is to understand whatever phenomenon is the focus of their attention. They want to make sense of the world -- as a concept -- and they often enjoy opportunities to be creative. INTPs are logical, analytical, and detached in their approach to the world; they naturally question and critique ideas and events as they strive for understanding. INTPs usually have little need to control the outer world, or to bring order to it, and they often appear very flexible and adaptable in their lifestyle.<a href=\"https://en.wikipedia.org/wiki/INTP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "INFJ",
  "summary": "<h4>\"ADVOCATE\"</h4> For INFJs the dominant quality in their lives is their attention to the inner world of possibilities, ideas, and symbols. Knowing by way of insight is paramount for INFJs, and they often manifest a deep concern for people and relationships as well. INFJs often have deep interests in creative expression as well as issues of spirituality and human development. While the energy and attention of INFJs are naturally drawn to the inner world of ideas and insights, what people often first encounter with INFJs is their drive for closure and for the application of their ideas to people's concerns.<a href=\"https://en.wikipedia.org/wiki/INFJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "INTJ",
  "summary": "<h4>\"ARCHITECT\"</h4> For INTJs the dominant force in their lives is their attention to the inner world of possibilities, symbols, abstractions, images, and thoughts. Insight in conjunction with logical analysis is the essence of their approach to the world; they think systemically. Ideas are the substance of life for INTJs and they have a driving need to understand, to know, and to demonstrate competence in their areas of interest. INTJs inherently trust their insights, and with their task-orientation will work intensely to make their visions into realities.<a href=\"https://en.wikipedia.org/wiki/INTJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ISTJ",
   "summary": "<h4>\"LOGISTICIAN\"</h4> For ISTJs the dominant quality in their lives is an abiding sense of responsibility for doing what needs to be done in the here-and-now. Their realism, organizing abilities, and command of the facts lead to their completing tasks thoroughly and with great attention to detail. Logical pragmatists at heart, ISTJs make decisions based on their experience and with an eye to efficiency in all things. ISTJs are intensely committed to people and to the organizations of which they are a part; they take their work seriously and believe others should do so as well.<a href=\"https://en.wikipedia.org/wiki/ISTJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ISFJ",
  "summary": "<h4>\"DEFENDER\"</h4> For ISFJs the dominant quality in their lives is an abiding respect and sense of personal responsibility for doing what needs to be done in the here-and-now. Actions that are of practical help to others are of particular importance to ISFJs. Their realism, organizing abilities, and command of the facts lead to their thorough attention in completing tasks. ISFJs bring an aura of quiet warmth, caring, and dependability to all that they do; they take their work seriously and believe others should do so as well.<a href=\"https://en.wikipedia.org/wiki/ISFJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ISTP",
  "summary": "<h4>\"VIRTUOSO\"</h4> For ISTPs the driving force in their lives is to understand how things and phenomena in the real world work so they can make the best and most effective use of them. ISTPs are logical and realistic people, and they are natural troubleshooters. When not actively solving a problem, ISTPs are quiet and analytical observers of their environment, and they naturally look for the underlying sense to any facts they have gathered. ISTPs do often pursue variety and even excitement in their hands-on experiences. Although they do have a spontaneous, even playful side, what people often first encounter with them is their detached pragmatism.<a href=\"https://en.wikipedia.org/wiki/ISTP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ISFP",
  "summary": "<h4>\"ADVENTURER\"</h4> For ISFPs the dominant quality in their lives is a deep-felt caring for living things, combined with a quietly playful and sometimes adventurous approach to life and all its experiences. ISFPs typically show their caring in very practical ways, since they often prefer action to words. Their warmth and concern are generally not expressed openly, and what people often first encounter with ISFPs is their quiet adaptability, realism, and free spirit spontaneity.<a href=\"https://en.wikipedia.org/wiki/ISFP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ENFP",
  "summary": "<h4>\"CAMPAIGNER\"</h4> For ENFPs the dominant quality in their lives is their attention to the outer world of possibilities; they are excited by continuous involvement in anything new, whether it be new ideas, new people, or new activities. Though ENFPs thrive on what is possible and what is new, they also experience a deep concern for people as well. Thus, they are especially interested in possibilities for people. ENFPs are typically energetic, enthusiastic people who lead spontaneous and adaptable lives.<a href=\"https://en.wikipedia.org/wiki/ENFP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ENTP",
  "summary": "<h4>\"DEBATER\"</h4> For ENTPs the driving quality in their lives is their attention to the outer world of possibilities; they are excited by continuous involvement in anything new, whether it be new ideas, new people, or new activities. They look for patterns and meaning in the world, and they often have a deep need to analyze, to understand, and to know the nature of things. ENTPs are typically energetic, enthusiastic people who lead spontaneous and adaptable lives.<a href=\"https://en.wikipedia.org/wiki/ENTP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ENFJ",
  "summary": "<h4>\"PROTAGONIST\"</h4> For ESFJs the dominant quality in their lives is an active and intense caring about people and a strong desire to bring harmony into their relationships. ESFJs bring an aura of warmth to all that they do, and they naturally move into action to help others, to organize the world around them, and to get things done. Sensing orients their feeling to current facts and realities, and thus gives their feeling a hands-on pragmatic quality. ESFJs take their work seriously and believe others should as well.<a href=\"https://en.wikipedia.org/wiki/ENFJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ENTJ",
  "summary": "<h4>\"COMMANDER\"</h4> For ENTJs the driving force in their lives is their need to analyze and bring into logical order the outer world of events, people, and things. ENTJs are natural leaders who build conceptual models that serve as plans for strategic action. Intuition orients their thinking to the future, and gives their thinking an abstract quality. ENTJs will actively pursue and direct others in the pursuit of goals they have set, and they prefer a world that is structured and organized.<a href=\"https://en.wikipedia.org/wiki/ENTJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ESTJ",
  "summary": "<h4>\"EXECUTIVE\"</h4> For ESTJs the driving force in their lives is their need to analyze and bring into logical order the outer world of events, people, and things. ESTJs like to organize anything that comes into their domain, and they will work energetically to complete tasks so they can quickly move from one to the next. Sensing orients their thinking to current facts and realities, and thus gives their thinking a pragmatic quality. ESTJs take their responsibilities seriously and believe others should do so as well.<a href=\"https://en.wikipedia.org/wiki/ESTJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ESFJ",
  "summary": "<h4>\"CONSUL\"</h4> For ESFJs the dominant quality in their lives is an active and intense caring about people and a strong desire to bring harmony into their relationships. ESFJs bring an aura of warmth to all that they do, and they naturally move into action to help others, to organize the world around them, and to get things done. Sensing orients their feeling to current facts and realities, and thus gives their feeling a hands-on pragmatic quality. ESFJs take their work seriously and believe others should as well.<a href=\"https://en.wikipedia.org/wiki/ESFJ\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ESTP",
  "summary": "<h4>\"ENTREPRENEUR\"</h4> For ESTPs the dominant quality in their lives is their enthusiastic attention to the outer world of hands-on and real-life experiences. ESTPs are excited by continuous involvement in new activities and in the pursuit of new challenges. ESTPs tend to be logical and analytical in their approach to life, and they have an acute sense of how objects, events, and people in the world work. ESTPs are typically energetic and adaptable realists, who prefer to experience and accept life rather than to judge or organize it.<a href=\"https://en.wikipedia.org/wiki/ESTP\" target=\"_blank\"><p>More inforamtion</p></a>"},

{"name": "ESFP",
  "summary": "<h4>\"ENTERTAINER\"</h4> For ESFPs the dominant quality in their lives is their enthusiastic attention to the outer world of hands-on and real-life experiences. ESFPs are excited by continuous involvement in new activities and new relationships. ESFPs also have a deep concern for people, and they show their caring in warm and pragmatic gestures of helping. ESFPs are typically energetic and adaptable realists, who prefer to experience and accept life rather than to judge or organize it.<a href=\"https://en.wikipedia.org/wiki/ESFP\" target=\"_blank\"><p>More inforamtion</p></a>"}
]
